# Location Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElement..::..Location Property
SpatialElement Class See Also
---
The location of the element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override Location Location { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property Location As Location
	Get
```

Visual C++
---
```text
public:
virtual property Location^ Location {
	Location^ get () override;
}
```

# Remarks
This is the location of the room within the level. The Z location should be the elevation of the level and not changeable.
# See Also
SpatialElement Class
Autodesk.Revit.DB Namespace